# Задача №3. 
# В некоторой школе решили набрать три новых 
# математических класса и оборудовать кабинеты для 
# них новыми партами. За каждой партой может сидеть 
# два учащихся. Известно количество учащихся в 
# каждом из трех классов. Выведите наименьшее 
# число парт, которое нужно приобрести для них.

# Input: 20 21 22(ввод чисел НЕ в одну строку)
# Output: 32




class1 = int (input('Сколько парт в 1м классе: '))
class2 = int (input('Сколько парт в 2м классе: '))
class3 = int (input('Сколько парт в 3м классе: '))

sum = (class1 + 1) // 2 + (class2 + 1) // 2 + (class3 + 1) // 2
print(f'Потребуется {sum} парт')