# Задание №6

# # Выведите в консоль таблицу умножения от 2х2 до 9х10
# # как на школьной тетрадке.

for i in range(2, 10, 4):
    for j in range(2, 11):
        for k in range(i, i + 4):
            print(f'{k:>3} *{j:>3} ={k * j:>3}', end='\t') # добавление пробелов
        print()
    print()


# --------------------или так-----------------

# ✔ Таблицу создайте в виде однострочного
# генератора, где каждый элемент генератора —
# отдельный пример таблицы умножения.
# ✔ Для вывода результата используйте «принт»
# без перехода на новую строку.

# res = [f'{k:>3} *{j:>3} ={(k * j):>3}' for i in range(2, 10, 4) for j in range(2, 11) for k in range(i, i + 4)]
res = ['\n'+'\t'.join([f'{k:>3} *{j:>3} ={(k * j):>3}'
                       for k in range(i, i + 4)])
       if i == 6 and j == 2 else '\t'.join([f'{k:>3} *{j:>3} ={(k * j):>3}'
                                            for k in range(i, i + 4)])
       for i in range(2, 10, 4)
       for j in range(2, 11)]

# print('\t'.join(res))


print(*res, sep='\n')
