# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

a = 45
b = "qwerty"
c = 3.05
d = True
e = None
print(type(a))
print(type(b))
print(type(c))
print(type(d))
print(type(e))