
# <_io.TextIOWrapper name='text_data.txt' mode='r' encoding='utf-8'>
# ['Привет мир\n', 'это я']

# ● Режимы работы с файлами
# Рассмотрим доступные режимы работы с файлами.
# ➢ 'r' — открыть для чтения (по умолчанию)
# ➢ 'w' — открыть для записи, предварительно очистив файл
# ➢ 'x' — открыть для эксклюзивного создания. Вернёт ошибку, если файл уже
# существует
# ➢ 'a' — открыть для записи в конец файла, если он существует
# ➢ 'b' — двоичный режим
# ➢ 't' — текстовый режим (по умолчанию)
# ➢ '+' — открыты для обновления (чтение и запись)
# ➢ 'w+' и 'w+b' открывают файл для чтения и записи и удаляют старое содержимое
# ➢ 'r+' и 'r+b' открывают на чтение и запись без удаления старой информации.





